<net name="adl_pcami_seg" version="10">
	<layers>
		<layer id="0" name="data_add_1746517470" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,256,1,1" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_add_1744917454" type="Const" version="opset1">
			<data element_type="f16" offset="512" shape="1,256,1,1" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data_add_1744117446" type="Const" version="opset1">
			<data element_type="f16" offset="1024" shape="1,320,1,1" size="640" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="MobilenetV2/expanded_conv_16/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="1664" shape="320,960,1,1" size="614400" />
			<output>
				<port id="0" names="MobilenetV2/expanded_conv_16/project/weights/read:0" precision="FP16">
					<dim>320</dim>
					<dim>960</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data_add_1743317438" type="Const" version="opset1">
			<data element_type="f16" offset="616064" shape="1,960,1,1" size="1920" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>960</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_1742517430" type="Const" version="opset1">
			<data element_type="f16" offset="617984" shape="1,960,1,1" size="1920" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>960</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="data_add_1736917374" type="Const" version="opset1">
			<data element_type="f16" offset="619904" shape="1,160,1,1" size="320" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="MobilenetV2/expanded_conv_13/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="620224" shape="160,576,1,1" size="184320" />
			<output>
				<port id="0" names="MobilenetV2/expanded_conv_13/project/weights/read:0" precision="FP16">
					<dim>160</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="data_add_1736117366" type="Const" version="opset1">
			<data element_type="f16" offset="804544" shape="1,576,1,1" size="1152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="data_add_1735317358" type="Const" version="opset1">
			<data element_type="f16" offset="805696" shape="1,576,1,1" size="1152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_1729717302" type="Const" version="opset1">
			<data element_type="f16" offset="806848" shape="1,96,1,1" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="MobilenetV2/expanded_conv_10/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="807040" shape="96,384,1,1" size="73728" />
			<output>
				<port id="0" names="MobilenetV2/expanded_conv_10/project/weights/read:0" precision="FP16">
					<dim>96</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_1728917294" type="Const" version="opset1">
			<data element_type="f16" offset="880768" shape="1,384,1,1" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_1728117286" type="Const" version="opset1">
			<data element_type="f16" offset="881536" shape="1,384,1,1" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="data_add_1720117206" type="Const" version="opset1">
			<data element_type="f16" offset="882304" shape="1,64,1,1" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="MobilenetV2/expanded_conv_6/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="882432" shape="64,192,1,1" size="24576" />
			<output>
				<port id="0" names="MobilenetV2/expanded_conv_6/project/weights/read:0" precision="FP16">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="data_add_1719317198" type="Const" version="opset1">
			<data element_type="f16" offset="907008" shape="1,192,1,1" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="data_add_1718517190" type="Const" version="opset1">
			<data element_type="f16" offset="907392" shape="1,192,1,1" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_1712917134" type="Const" version="opset1">
			<data element_type="f16" offset="907776" shape="1,32,1,1" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="MobilenetV2/expanded_conv_3/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="907840" shape="32,144,1,1" size="9216" />
			<output>
				<port id="0" names="MobilenetV2/expanded_conv_3/project/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="data_add_1712117126" type="Const" version="opset1">
			<data element_type="f16" offset="917056" shape="1,144,1,1" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="data_add_1711317118" type="Const" version="opset1">
			<data element_type="f16" offset="917344" shape="1,144,1,1" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="data_add_1708117086" type="Const" version="opset1">
			<data element_type="f16" offset="917632" shape="1,24,1,1" size="48" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="MobilenetV2/expanded_conv_1/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="917680" shape="24,96,1,1" size="4608" />
			<output>
				<port id="0" names="MobilenetV2/expanded_conv_1/project/weights/read:0" precision="FP16">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_1707317078" type="Const" version="opset1">
			<data element_type="f16" offset="922288" shape="1,96,1,1" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="data_add_1706517070" type="Const" version="opset1">
			<data element_type="f16" offset="922480" shape="1,96,1,1" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="data_add_1705717062" type="Const" version="opset1">
			<data element_type="f16" offset="922672" shape="1,16,1,1" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="922704" shape="16,32,1,1" size="1024" />
			<output>
				<port id="0" names="MobilenetV2/expanded_conv/project/weights/read:0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="data_add_1704917054" type="Const" version="opset1">
			<data element_type="f16" offset="923728" shape="1,32,1,1" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="data_add_17046" type="Const" version="opset1">
			<data element_type="f16" offset="923792" shape="1,32,1,1" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="mul/x" type="Const" version="opset1">
			<data element_type="f16" offset="923856" shape="1,1,1,1" size="2" />
			<output>
				<port id="0" names="mul/x:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="pad_to_bounding_box/Squeeze/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="923858" shape="1" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="pad_to_bounding_box/Pad/pad_value_convert_input_port_0/value" type="Const" version="opset1">
			<data element_type="f16" offset="923866" shape="" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="33" name="pad_to_bounding_box/ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="923858" shape="1" size="8" />
			<output>
				<port id="0" names="pad_to_bounding_box/ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape" type="Const" version="opset1">
			<data element_type="f16" offset="923868" shape="1,1,3" size="6" />
			<output>
				<port id="0" names="Reshape:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Squeeze/Dims" type="Const" version="opset1">
			<data element_type="i64" offset="923858" shape="1" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="ImageTensor/reverse_input_channels/Split_input_port_1/value2906731423" type="Const" version="opset1">
			<data element_type="i64" offset="923874" shape="" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="37" name="ImageTensor" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,240,240" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="ImageTensor/reverse_input_channels/Split" type="Split" version="opset1">
			<data num_splits="3" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" />
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="ImageTensor/reverse_input_channels/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="ImageTensor/Transpose/value2157231405" type="Const" version="opset1">
			<data element_type="i64" offset="923882" shape="4" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="ImageTensor/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="ImageTensor:0" precision="FP16">
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Cast:0,Squeeze:0" precision="FP16">
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="pad_to_bounding_box/sub" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/sub:0" precision="FP16">
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="pad_to_bounding_box/ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="pad_to_bounding_box/ExpandDims/Transpose/value2158831201" type="Const" version="opset1">
			<data element_type="i64" offset="923914" shape="4" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="pad_to_bounding_box/ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/ExpandDims:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="pad_to_bounding_box/Pad/pad_value_convert" type="ConvertLike" version="opset1">
			<input>
				<port id="0" />
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" />
			</output>
		</layer>
		<layer id="48" name="pad_to_bounding_box/stack_4/Unsqueeze" type="Const" version="opset1">
			<data element_type="i32" offset="923946" shape="1,2" size="8" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="pad_to_bounding_box/stack_4/Unsqueeze1082_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="923954" shape="1" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="pad_to_bounding_box/stack_1/Unsqueeze" type="Const" version="opset1">
			<data element_type="i32" offset="923962" shape="1" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0">
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Shape_1:0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="strided_slice_1/stack" type="Const" version="opset1">
			<data element_type="i64" offset="923954" shape="1" size="8" />
			<output>
				<port id="0" names="strided_slice_1/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="strided_slice_1/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="923874" shape="1" size="8" />
			<output>
				<port id="0" names="strided_slice_1/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="strided_slice_1/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="923874" shape="1" size="8" />
			<output>
				<port id="0" names="strided_slice_1/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="strided_slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1" />
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="strided_slice_1:0" precision="I32" />
			</output>
		</layer>
		<layer id="56" name="sub/x" type="Const" version="opset1">
			<data element_type="i32" offset="923966" shape="" size="4" />
			<output>
				<port id="0" names="sub/x:0" precision="I32" />
			</output>
		</layer>
		<layer id="57" name="sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" />
				<port id="1" />
			</input>
			<output>
				<port id="2" names="sub:0" precision="I32" />
			</output>
		</layer>
		<layer id="58" name="Maximum/y" type="Const" version="opset1">
			<data element_type="i32" offset="923962" shape="" size="4" />
			<output>
				<port id="0" names="Maximum/y:0" precision="I32" />
			</output>
		</layer>
		<layer id="59" name="Maximum" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" />
				<port id="1" />
			</input>
			<output>
				<port id="2" names="Maximum:0" precision="I32" />
			</output>
		</layer>
		<layer id="60" name="add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" />
				<port id="1" />
			</input>
			<output>
				<port id="2" names="add:0" precision="I32" />
			</output>
		</layer>
		<layer id="61" name="pad_to_bounding_box/sub_3/y" type="Const" version="opset1">
			<data element_type="i32" offset="923962" shape="" size="4" />
			<output>
				<port id="0" names="pad_to_bounding_box/sub_3/y:0" precision="I32" />
			</output>
		</layer>
		<layer id="62" name="pad_to_bounding_box/sub_3" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" />
				<port id="1" />
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/sub_3:0" precision="I32" />
			</output>
		</layer>
		<layer id="63" name="pad_to_bounding_box/unstack/Squeeze_1043_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="923954" shape="1" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="pad_to_bounding_box/unstack/Split_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="923954" shape="" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="65" name="pad_to_bounding_box/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="pad_to_bounding_box/Shape/GatherNCHWtoNHWC_input_port_1/value2188631513" type="Const" version="opset1">
			<data element_type="i32" offset="923970" shape="4" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="pad_to_bounding_box/Shape/GatherNCHWtoNHWC_input_port_2/value2188831207" type="Const" version="opset1">
			<data element_type="i64" offset="923954" shape="" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="68" name="pad_to_bounding_box/Shape/GatherNCHWtoNHWC" type="Gather" version="opset7">
			<data batch_dims="0" />
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2" />
			</input>
			<output>
				<port id="3" names="pad_to_bounding_box/Shape:0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="pad_to_bounding_box/unstack/Split" type="Split" version="opset1">
			<data num_splits="4" />
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
				<port id="4" precision="I32">
					<dim>1</dim>
				</port>
				<port id="5" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="pad_to_bounding_box/unstack/Squeeze_1043" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/unstack:1" precision="I32" />
			</output>
		</layer>
		<layer id="71" name="pad_to_bounding_box/sub_4" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" />
				<port id="1" />
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/sub_4:0" precision="I32" />
			</output>
		</layer>
		<layer id="72" name="pad_to_bounding_box/stack_1/Unsqueeze1091_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="923954" shape="1" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="pad_to_bounding_box/stack_1/Unsqueeze1091" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" />
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="pad_to_bounding_box/stack_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/stack_1:0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="pad_to_bounding_box/stack_4/Unsqueeze1082" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="pad_to_bounding_box/stack_2/Unsqueeze" type="Const" version="opset1">
			<data element_type="i32" offset="923962" shape="1" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="strided_slice_2/stack" type="Const" version="opset1">
			<data element_type="i64" offset="923874" shape="1" size="8" />
			<output>
				<port id="0" names="strided_slice_2/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="strided_slice_2/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="923986" shape="1" size="8" />
			<output>
				<port id="0" names="strided_slice_2/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="strided_slice_2/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="923874" shape="1" size="8" />
			<output>
				<port id="0" names="strided_slice_2/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="strided_slice_2" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1" />
			<input>
				<port id="0">
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="strided_slice_2:0" precision="I32" />
			</output>
		</layer>
		<layer id="81" name="sub_1/x" type="Const" version="opset1">
			<data element_type="i32" offset="923966" shape="" size="4" />
			<output>
				<port id="0" names="sub_1/x:0" precision="I32" />
			</output>
		</layer>
		<layer id="82" name="sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" />
				<port id="1" />
			</input>
			<output>
				<port id="2" names="sub_1:0" precision="I32" />
			</output>
		</layer>
		<layer id="83" name="Maximum_1/y" type="Const" version="opset1">
			<data element_type="i32" offset="923962" shape="" size="4" />
			<output>
				<port id="0" names="Maximum_1/y:0" precision="I32" />
			</output>
		</layer>
		<layer id="84" name="Maximum_1" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" />
				<port id="1" />
			</input>
			<output>
				<port id="2" names="Maximum_1:0" precision="I32" />
			</output>
		</layer>
		<layer id="85" name="add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" />
				<port id="1" />
			</input>
			<output>
				<port id="2" names="add_1:0" precision="I32" />
			</output>
		</layer>
		<layer id="86" name="pad_to_bounding_box/sub_1/y" type="Const" version="opset1">
			<data element_type="i32" offset="923962" shape="" size="4" />
			<output>
				<port id="0" names="pad_to_bounding_box/sub_1/y:0" precision="I32" />
			</output>
		</layer>
		<layer id="87" name="pad_to_bounding_box/sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" />
				<port id="1" />
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/sub_1:0" precision="I32" />
			</output>
		</layer>
		<layer id="88" name="pad_to_bounding_box/unstack/Squeeze_1045_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="923954" shape="1" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="pad_to_bounding_box/unstack/Squeeze_1045" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/unstack:2" precision="I32" />
			</output>
		</layer>
		<layer id="90" name="pad_to_bounding_box/sub_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" />
				<port id="1" />
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/sub_2:0" precision="I32" />
			</output>
		</layer>
		<layer id="91" name="pad_to_bounding_box/stack_2/Unsqueeze1077_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="923954" shape="1" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="pad_to_bounding_box/stack_2/Unsqueeze1077" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" />
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="pad_to_bounding_box/stack_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/stack_2:0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="pad_to_bounding_box/stack_4/Unsqueeze1084_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="923954" shape="1" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="pad_to_bounding_box/stack_4/Unsqueeze1084" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="pad_to_bounding_box/stack_4/Unsqueeze1086" type="Const" version="opset1">
			<data element_type="i32" offset="923994" shape="1,2" size="8" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="pad_to_bounding_box/stack_4" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" names="pad_to_bounding_box/stack_4:0" precision="I32">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="1052_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="924002" shape="2" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="1052" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="1054_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="924018" shape="" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="101" name="1054" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="1056_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="924018" shape="1" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="1056" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="pad_to_bounding_box/Pad/GatherNHWCtoNCHW21926_input_port_1/value2192831399" type="Const" version="opset1">
			<data element_type="i32" offset="924026" shape="4" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="pad_to_bounding_box/Pad/GatherNHWCtoNCHW21926_input_port_2/value2193031294" type="Const" version="opset1">
			<data element_type="i64" offset="924018" shape="" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="106" name="pad_to_bounding_box/Pad/GatherNHWCtoNCHW21926" type="Gather" version="opset7">
			<data batch_dims="0" />
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="pad_to_bounding_box/Pad/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="1058_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="924018" shape="1" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="1058" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="pad_to_bounding_box/Pad/GatherNHWCtoNCHW_input_port_1/value2192231363" type="Const" version="opset1">
			<data element_type="i32" offset="924026" shape="4" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="pad_to_bounding_box/Pad/GatherNHWCtoNCHW_input_port_2/value2192431189" type="Const" version="opset1">
			<data element_type="i64" offset="924018" shape="" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="112" name="pad_to_bounding_box/Pad/GatherNHWCtoNCHW" type="Gather" version="opset7">
			<data batch_dims="0" />
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="pad_to_bounding_box/Pad/Cast_2" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="pad_to_bounding_box/Pad" type="Pad" version="opset1">
			<data pad_mode="constant" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3" />
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="pad_to_bounding_box/Pad/Transpose/value2157631222" type="Const" version="opset1">
			<data element_type="i64" offset="923882" shape="4" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="pad_to_bounding_box/Pad/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/Pad:0" precision="FP16">
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="pad_to_bounding_box/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/Squeeze:0" precision="FP16">
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Reshape31231" type="Const" version="opset1">
			<data element_type="f16" offset="924042" shape="1,1,3" size="6" />
			<output>
				<port id="0" names="Reshape:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="pad_to_bounding_box/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="pad_to_bounding_box/add:0" precision="FP16">
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="ExpandDims/dim" type="Const" version="opset1">
			<data element_type="i64" offset="924018" shape="1" size="8" />
			<output>
				<port id="0" names="ExpandDims/dim:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="ExpandDims" type="Unsqueeze" version="opset1">
			<input>
				<port id="0">
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="ExpandDims/Transpose/value2159231108" type="Const" version="opset1">
			<data element_type="i64" offset="923914" shape="4" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="ExpandDims/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>240</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="ExpandDims:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="2" names="mul:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="sub_2/y" type="Const" version="opset1">
			<data element_type="f16" offset="924048" shape="1,1,1,1" size="2" />
			<output>
				<port id="0" names="sub_2/y:0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="sub_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="MobilenetV2/MobilenetV2/input:0,sub_2:0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="MobilenetV2/Conv/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="924050" shape="32,3,3,3" size="1728" />
			<output>
				<port id="0" names="MobilenetV2/Conv/weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="MobilenetV2/Conv/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="MobilenetV2/Conv/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="MobilenetV2/Conv/BatchNorm/FusedBatchNormV3:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="MobilenetV2/Conv/Relu6" type="Clamp" version="opset1">
			<data max="6.0" min="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="MobilenetV2/Conv/Relu6:0,MobilenetV2/expanded_conv/input:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="925778" shape="32,1,1,3,3" size="576" />
			<output>
				<port id="0" names="MobilenetV2/expanded_conv/depthwise/depthwise_weights/read:0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="MobilenetV2/expanded_conv/depthwise/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="MobilenetV2/expanded_conv/depthwise/BatchNorm/FusedBatchNormV3:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="MobilenetV2/expanded_conv/depthwise/Relu6" type="Clamp" version="opset1">
			<data max="6.0" min="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="MobilenetV2/expanded_conv/depthwise/Relu6:0,MobilenetV2/expanded_conv/depthwise_output:0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="MobilenetV2/expanded_conv/project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="MobilenetV2/expanded_conv/output:0,MobilenetV2/expanded_conv/project/BatchNorm/FusedBatchNormV3:0,MobilenetV2/expanded_conv/project/Identity:0,MobilenetV2/expanded_conv_1/input:0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="926354" shape="96,16,1,1" size="3072" />
			<output>
				<port id="0" names="MobilenetV2/expanded_conv_1/expand/weights/read:0" precision="FP16">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="MobilenetV2/expanded_conv_1/expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" pads_begin="0,0" pads_end="0,0" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="MobilenetV2/expanded_conv_1/expand/BatchNorm/FusedBatchNormV3:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="MobilenetV2/expanded_conv_1/expand/Relu6" type="Clamp" version="opset1">
			<data max="6.0" min="0.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="MobilenetV2/expanded_conv_1/expand/Relu6:0,MobilenetV2/expanded_conv_1/expansion_output:0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="MobilenetV2/expanded_conv_1/depthwise/BatchNorm/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f16" offset="929426" shape="96,1,1,3,3" size="1728" />
			<output>
				<port id="0" names="MobilenetV2/expanded_conv_1/depthwise/depthwise_weights/read:0" precision="FP16">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="MobilenetV2/expanded_conv_1/depthwise/depthwise" type="GroupConvolution" version="opset1">
